app/views/searches/show.html.erb

SELECT  1 AS one FROM "products" WHERE (title LIKE 'vivo') AND (model LIKE 'v9 youth') AND (condition LIKE 'used') LIMIT ?  [["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE (price >= 800.0) AND (price <= 1000.0)
---
<p><%= link_to "Back", new_search_path %></p>
<% if @search.search_products.empty? %>