app/controllers/likes_controller.rb

INSERT INTO "likes" ("product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["user_id", 4], ["created_at", "2019-05-18 07:25:05.845474"], ["updated_at", "2019-05-18 07:25:05.845474"]]
---
  def create
    if already_liked?
      flash[:notice] = "You can't like more than once"
    else
      @product.likes.create(user_id: current_user.id)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_product
    @product = Product.find(params[:product_id])