app/controllers/products_controller.rb

  def index
    # @products = Product.all.order("created_at desc")
    @products = Product.search(params[:search])
---
SELECT "products".* FROM "products" WHERE (title LIKE '%vivo%')

  def create
    @product = current_user.products.build(product_params)
    respond_to do |format|
    if @product.save
---
INSERT INTO "products" ("model", "description", "condition", "title", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["model", "z"], ["description", "z"], ["condition", "New"], ["title", "z"], ["created_at", "2019-06-16 13:43:14.209803"], ["updated_at", "2019-06-16 13:43:14.209803"], ["user_id", 3]]

  def update
    respond_to do |format|

      if @product.update(product_params)
---
UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "4GB memory\\n\r\nOctacore Processor\\n\r\n12 megapixel camera"], ["updated_at", "2019-04-19 05:08:00.660518"], ["id", 1]]