app/controllers/searches_controller.rb

INSERT INTO "searches" ("title", "condition", "model", "min_price", "max_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", ""], ["condition", ""], ["model", ""], ["min_price", 800.0], ["max_price", 1000.0], ["created_at", "2019-06-17 08:27:12.539004"], ["updated_at", "2019-06-17 08:27:12.539004"]]
---
  def create
    @search = Search.create(search_params)

SELECT  "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @search= Search.find(params[:id])