app/views/products/show.html.erb

<%= button_to 'Like', product_likes_path(@product), method: :product %>
<p><%= @product.likes.count %> <%= (@product.likes.count) == 1 ? 'Like' : 'Likes'%></p>

<% pre_like = @product.likes.find { |like| like.user_id == current_user.id} %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."product_id" = ?  [["product_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."product_id" = ?  [["product_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]